In [125]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier
data = pd.read_csv('C:\\Users\\todosuk\\Desktop\\titanic.csv', sep =';',decimal=',')

In [126]:
sample = data[['pclass','fare','age', 'sex','survived']]# Создаем новый датафрайм с нужными столбцами
sample = sample.replace(to_replace=['male', 'female'], value=[0, 1])# Заменяем male на 0, female на 1
print ('Male = 0, female = 1')
sample = sample.dropna()# Удаляем объекты содержащие NaN
sample.head(10)

Male = 0, female = 1

   pclass      fare      age  sex  survived
0       1  211.3375  29.0000    1         1
1       1  151.5500   0.9167    0         1
2       1  151.5500   2.0000    1         0
3       1  151.5500  30.0000    0         0
4       1  151.5500  25.0000    1         0
5       1   26.5500  48.0000    0         1
6       1   77.9583  63.0000    1         1
7       1    0.0000  39.0000    0         0
8       1   51.4792  53.0000    1         1
9       1   49.5042  71.0000    0         0

In [127]:
target = sample.survived #Выделяем целевую переменную

In [136]:
train = sample[['pclass','fare','age', 'sex']] # Убираем колонку survived из датасета (это целевая переменная)

   pclass      fare      age  sex
0       1  211.3375  29.0000    1
1       1  151.5500   0.9167    0
2       1  151.5500   2.0000    1
3       1  151.5500  30.0000    0
4       1  151.5500  25.0000    1
5       1   26.5500  48.0000    0
6       1   77.9583  63.0000    1
7       1    0.0000  39.0000    0
8       1   51.4792  53.0000    1
9       1   49.5042  71.0000    0

In [150]:
clf = DecisionTreeClassifier(random_state=241)

In [153]:
clf.fit(train, target)# Обучаем алгоритм (X и y должны иметь одинаковое колличество строк)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=241,
            splitter='best')

In [155]:
importances = clf.feature_importances_ # Вычисляем важность признаков
importances

array([ 0.12091021,  0.31629677,  0.25742701,  0.30536601])

In [173]:
clf.predict([[3,26,30,0]]) #Предсказываем выживание (3- й класс, 26 -цена, 30- возраст, 0- мужчина)

array([0], dtype=int64)